export const HomePage = () => {
	return (
		<div className="container-fluid p-3">
			<div className="container border p-3">
				<h2 className="text-center">Привет!</h2>
				<br></br>
				<p className="homePage-text__title">
					Знаю, может быть это не интересно читать, но задание было довольно
					интересным, легким, и удобным. Заранее хотел бы поблагодарить за то,
					что не стали нагружать таской на неделю. И спасибо за предоставленный
					ответ на отзыв.
				</p>
				<br></br>
				<p className="homePage-text__title">
					Хочу сказать пару слов про задание. Да, его можно было бы улучшить,
					причем кардинально. Стилизацию я уже не смог придумать, перерыл весь
					интернет, глаз ничего не зацепило. Без дизайнеров жить и правда
					трудновато. Мб в будущем что - то докручу.
				</p>
				<br></br>
				<p className="homePage-text__title">
					Может показаться, что в некоторых моментах странные движения по коду,
					не обращайте внимания, иногда я мог написать проще или же сложнее,
					просто полюбил такой синтаксический сахар. Особенно модалку, вся
					запара по поводу нее ради того, чтобы в будущем ее масштабировать, и
					не дублировать код в каждом компоненте по ее вызову. Хотя так тоже
					можно было бы, для этого задания самое то, но мне захотелось вот так.
				</p>
				<br></br>
				<p className="homePage-text__title">
					Можно было бы напихать еще кучу компонентов. Попилить модалку на
					каркас и форму, создать валидацию через сторонние библиотеки, сделать
					отличные анимации. Оформить какой - то рандомный логотип из интернета.
					Сделать респонсив. Сделать ре-експорты. Добавить спиннер на интернет.
					Накидать милларды мета - тегов.
				</p>
				<br></br>
				<p className="homePage-text__title">
					НО! Я считаю это оверкиллом в данной ситуации. Задачи были выполнены,
					функционал требуюмый в наличии, отлажен, и работает. Уверен, что у вас
					будет работать весь предоставленный мною функционал.
				</p>
				<br></br>
				<h2 className="text-center">Приятного хакинга!</h2>
			</div>
		</div>
	);
};
